Public Member Functions | Protected Member Functions | List of all members
ACAPI::v1::ElementDefault Class Reference
Element Manager
A base class for all element defaults. More...
#include <ElementDefault.hpp>
 Inheritance diagram for ACAPI::v1::ElementDefault:
 Public Member Functions
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
 const API_Token &  | GetToken () const
 Protected Member Functions
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Detailed Description
A base class for all element defaults.
This class represents the default state of Archicad elements. When an element is placed in Archicad, either from the API of from the UI, it always uses the Element Defaults as its default parameters.
Member Function Documentation
◆ SetAsArchicadDefault()
 Result< void > ACAPI::v1::ElementDefault::SetAsArchicadDefault  |  ( |   | ) |   const
Sets the locally prepared Default settings to the Archicad Default.
Returns
Error if Archicad could not apply the set of values to the Default.